driver-tests/bpelse/assign/AssignJbi/test/echoUnsignedByteDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoUnsignedByteDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoUnsignedByteDataType">
    <string>6</string>
    <normalizedString>6</normalizedString>
    <token>6</token>
    <base64Binary>6</base64Binary>
    <hexBinary>6</hexBinary>
    <integer>6</integer>
    <positiveInteger>6</positiveInteger>
    <negativeInteger>6</negativeInteger>
    <nonNegativeInteger>6</nonNegativeInteger>
    <nonPositiveInteger>6</nonPositiveInteger>
    <long>6</long>
    <unsignedLong>6</unsignedLong>
    <int>6</int>
    <unsignedInt>6</unsignedInt>
    <short>6</short>
    <unsignedShort>6</unsignedShort>
    <byte>6</byte>
    <unsignedByte>6</unsignedByte>
    <decimal>6</decimal>
    <float>6</float>
    <double>6</double>
    <boolean>6</boolean>
    <duration>6</duration>
    <dateTime>6</dateTime>
    <date>6</date>
    <time>6</time>
    <gYear>6</gYear>
    <gYearMonth>6</gYearMonth>
    <gMonth>6</gMonth>
    <gMonthDay>6</gMonthDay>
    <gDay>6</gDay>
    <Name>6</Name>
    <QName>6</QName>
    <NCName>6</NCName>
    <anyURI>6</anyURI>
    <language>6</language>
    <ID>6</ID>
    <IDREF>6</IDREF>
    <IDREFS>6</IDREFS>
    <ENTITY>6</ENTITY>
    <ENTITIES>6</ENTITIES>
    <NMTOKEN>6</NMTOKEN>
    <NMTOKENS>6</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
